{
  "primary": [
    {
      "header": "Work Experience",
      "contents": [
        {
          "subheader": "Software Engineer",
          "bold": "Obscurity Labs LLC",
          "tiny": "MAY 2022 - PRESENT",
          "bullets": [
            "Pioneered the successful delivery of an open-source web application by mentoring interns, leveraging FastAPI to efficiently parse ISO files into a structured database.",
            "Engineered and optimized cutting-edge features for web applications using AngularJS and React, ensuring cross-browser compatibility and an intuitive user experience.",
            "Architected and implemented scalable endpoints for REST APIs, enhancing system interoperability and performance.",
            "Consistently maintained and enhanced test coverage to exceed 80%, driving quality assurance and minimizing defect rates.",
            "Proactively identified and mitigated potential issues during comprehensive release reviews, ensuring robust and stable version releases. ",
            "Designed and created high-fidelity thumbnails for React components, improving visual clarity and user engagement. ",
            "Innovatively developed a feature that transformed user data organization, significantly boosting user productivity and satisfaction. ",
            "Authored and updated comprehensive user guides to reflect new features and UI enhancements, ensuring seamless user adoption and knowledge transfer."
          ]
        },
        {
          "subheader": "Web Content Assistant",
          "bold": "East Stroudsburg University Academic Computing",
          "tiny": "JAN 2020 - MAY 2022",
          "bullets": [
            "Developed automated web testing software in JavaScript, utilizing Selenium and Mocha libraries to ensure comprehensive test coverage and reliability.",
            "Administered PowerShell scripts and SQL queries to efficiently convert images to .webp format, significantly refined website performance and load times.",
            "Enhanced web accessibility features, ensuring compliance with ADA standards and improving the user experience for individuals using screen readers.",
            "Conducted thorough research and comparative analysis of digital signage solutions, successfully setting up an improved digital signage system to enhance information dissemination."
          ]
        },
        {
          "subheader": "President",
          "bold": "ESU Computer Science Organization",
          "tiny": "MAY 2020 - MAY 2022",
          "bullets": [
            "Orchestrated the club’s operations during a global pandemic, earning a certificate of recognition for maintaining an active and engaged membership.",
            "Honored with the Student Leader Award for exemplary leadership and contribution to the university community.",
            "Successfully organized and led two charity live streams, raising over $4000 for children’s hospitals.",
            "Developed and facilitated member opportunities through structured roles, impactful projects, and skill-building workshops, fostering professional growth and collaboration."
          ]
        }
      ]
    },
    {
      "header": "Projects",
      "contents": [
        {
          "subheader": "Developer",
          "bold": "MAUTE.us",
          "tiny": "MAR 2024 - PRESENT",
          "bullets": [
            "Conceptualized and designed the overarching theme and diverse color schemes, ensuring a visually appealing and cohesive user experience.",
            "Engineered a responsive website using React+Vite and MUI, delivering a seamless and performant interface.",
            "Hand-drew intricate SVG files for accent background images, enhancing the site's visual aesthetics.",
            "Automated the deployment process by implementing a GitHub Action to streamline site releases to production.",
            "Developed a user-friendly JSON schema for non-developer readability, improving accessibility and ease of use for family."
          ]
        },
        {
          "subheader": "Project Lead",
          "bold": "Darkmoon",
          "tiny": "JUL 2022-AUG 2022, JUL 2023-AUG 2023",
          "bullets": [
            "Strategically planned project milestones, defined sprints, and managed tickets to ensure timely and efficient project delivery.",
            "Mentored and guided a team of interns, providing comprehensive support and fostering a collaborative development environment.",
            "Conducted daily stand-up meetings to track progress and ensure alignment with project goals and deadlines.",
            "Delivered a professional presentation of the project’s achievements to the Commonwealth Cyber Initiative, showcasing the team's work and outcomes."
          ]
        }
      ]
    }
  ],
  "secondary": [
    {
      "header": "Education",
      "contents": [
        {
          "subheader": "Computer Science (B.S)",
          "subheader2": "Minor in Mathematics",
          "bold": "East Stroudsburg University",
          "tiny": "MAY 2023"
        }
      ]
    },
    {
      "header": "Skills",
      "contents": [
        {
          "subheader": "Programming Languages",
          "items": [
            "JavaScript",
            "TypeScript",
            "Python",
            "SQL",
            "Powershell Scripting"
          ]
        },
        {
          "subheader": "Frameworks",
          "items": ["FastAPI", "React", "AngularJS", "Django"]
        },
        {
          "subheader": "Soft Skills",
          "items": [
            "Communication",
            "Leadership",
            "Event Planning",
            "Project Management"
          ]
        }
      ]
    }
  ]
}
